codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz0512eff144.h
#define _TRISH_TRISH12_POSITION                  0x0000000C
#define _TRISH_TRISH12_MASK                      0x00001000
#define _TRISH_TRISH12_LENGTH                    0x00000001

#define _TRISH_TRISH13_POSITION                  0x0000000D
#define _TRISH_TRISH13_MASK                      0x00002000
#define _TRISH_TRISH13_LENGTH                    0x00000001

#define _TRISH_TRISH14_POSITION                  0x0000000E
#define _TRISH_TRISH14_MASK                      0x00004000
#define _TRISH_TRISH14_LENGTH                    0x00000001

#define _TRISH_TRISH15_POSITION                  0x0000000F
#define _TRISH_TRISH15_MASK                      0x00008000
#define _TRISH_TRISH15_LENGTH                    0x00000001

#define _TRISH_w_POSITION                        0x00000000
#define _TRISH_w_MASK                            0xFFFFFFFF
#define _TRISH_w_LENGTH                          0x00000020

#define _PORTH_RH0_POSITION                      0x00000000
#define _PORTH_RH0_MASK                          0x00000001
#define _PORTH_RH0_LENGTH                        0x00000001

#define _PORTH_RH1_POSITION                      0x00000001
#define _PORTH_RH1_MASK                          0x00000002
#define _PORTH_RH1_LENGTH                        0x00000001

#define _PORTH_RH2_POSITION                      0x00000002
#define _PORTH_RH2_MASK                          0x00000004
#define _PORTH_RH2_LENGTH                        0x00000001

#define _PORTH_RH3_POSITION                      0x00000003
#define _PORTH_RH3_MASK                          0x00000008
#define _PORTH_RH3_LENGTH                        0x00000001

#define _PORTH_RH4_POSITION                      0x00000004
#define _PORTH_RH4_MASK                          0x00000010
#define _PORTH_RH4_LENGTH                        0x00000001

#define _PORTH_RH5_POSITION                      0x00000005
#define _PORTH_RH5_MASK                          0x00000020
#define _PORTH_RH5_LENGTH                        0x00000001

#define _PORTH_RH6_POSITION                      0x00000006
#define _PORTH_RH6_MASK                          0x00000040
#define _PORTH_RH6_LENGTH                        0x00000001

#define _PORTH_RH7_POSITION                      0x00000007
#define _PORTH_RH7_MASK                          0x00000080
#define _PORTH_RH7_LENGTH                        0x00000001

#define _PORTH_RH8_POSITION                      0x00000008
#define _PORTH_RH8_MASK                          0x00000100
#define _PORTH_RH8_LENGTH                        0x00000001

#define _PORTH_RH9_POSITION                      0x00000009
#define _PORTH_RH9_MASK                          0x00000200
#define _PORTH_RH9_LENGTH                        0x00000001

#define _PORTH_RH10_POSITION                     0x0000000A
#define _PORTH_RH10_MASK                         0x00000400
#define _PORTH_RH10_LENGTH                       0x00000001

#define _PORTH_RH11_POSITION                     0x0000000B
#define _PORTH_RH11_MASK                         0x00000800
#define _PORTH_RH11_LENGTH                       0x00000001

#define _PORTH_RH12_POSITION                     0x0000000C
#define _PORTH_RH12_MASK                         0x00001000
#define _PORTH_RH12_LENGTH                       0x00000001

#define _PORTH_RH13_POSITION                     0x0000000D
#define _PORTH_RH13_MASK                         0x00002000
#define _PORTH_RH13_LENGTH                       0x00000001

#define _PORTH_RH14_POSITION                     0x0000000E
#define _PORTH_RH14_MASK                         0x00004000
#define _PORTH_RH14_LENGTH                       0x00000001

#define _PORTH_RH15_POSITION                     0x0000000F
#define _PORTH_RH15_MASK                         0x00008000
#define _PORTH_RH15_LENGTH                       0x00000001

#define _PORTH_w_POSITION                        0x00000000
#define _PORTH_w_MASK                            0xFFFFFFFF
#define _PORTH_w_LENGTH                          0x00000020

#define _LATH_LATH0_POSITION                     0x00000000
#define _LATH_LATH0_MASK                         0x00000001
#define _LATH_LATH0_LENGTH                       0x00000001

#define _LATH_LATH1_POSITION                     0x00000001
#define _LATH_LATH1_MASK                         0x00000002
#define _LATH_LATH1_LENGTH                       0x00000001

#define _LATH_LATH2_POSITION                     0x00000002
#define _LATH_LATH2_MASK                         0x00000004
#define _LATH_LATH2_LENGTH                       0x00000001

#define _LATH_LATH3_POSITION                     0x00000003
#define _LATH_LATH3_MASK                         0x00000008
#define _LATH_LATH3_LENGTH                       0x00000001

#define _LATH_LATH4_POSITION                     0x00000004
#define _LATH_LATH4_MASK                         0x00000010
#define _LATH_LATH4_LENGTH                       0x00000001

#define _LATH_LATH5_POSITION                     0x00000005
#define _LATH_LATH5_MASK                         0x00000020
#define _LATH_LATH5_LENGTH                       0x00000001

#define _LATH_LATH6_POSITION                     0x00000006
#define _LATH_LATH6_MASK                         0x00000040
#define _LATH_LATH6_LENGTH                       0x00000001

#define _LATH_LATH7_POSITION                     0x00000007
#define _LATH_LATH7_MASK                         0x00000080
#define _LATH_LATH7_LENGTH                       0x00000001

#define _LATH_LATH8_POSITION                     0x00000008
#define _LATH_LATH8_MASK                         0x00000100
#define _LATH_LATH8_LENGTH                       0x00000001

#define _LATH_LATH9_POSITION                     0x00000009
#define _LATH_LATH9_MASK                         0x00000200
#define _LATH_LATH9_LENGTH                       0x00000001

#define _LATH_LATH10_POSITION                    0x0000000A
#define _LATH_LATH10_MASK                        0x00000400
#define _LATH_LATH10_LENGTH                      0x00000001

#define _LATH_LATH11_POSITION                    0x0000000B
#define _LATH_LATH11_MASK                        0x00000800
#define _LATH_LATH11_LENGTH                      0x00000001

